## Plan Result (stg_core)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 8 to change, 7 to destroy.</code></pre>

* Create
  * module.core-infra.module.networking.azurerm_network_security_group.this[&#34;gateway-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.deny_inbound[&#34;gateway-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;gateway-nsg-allow_http&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;gateway-nsg-allow_https&#34;]
  * module.core-infra.module.networking.azurerm_route.this[&#34;rt-RFC_1918_A&#34;]
  * module.core-infra.module.networking.azurerm_route.this[&#34;rt-RFC_1918_B&#34;]
  * module.core-infra.module.networking.azurerm_route.this[&#34;rt-RFC_1918_C&#34;]
  * module.core-infra.module.networking.azurerm_subnet.this[&#34;vnet-nle-int-01-gateway&#34;]
  * module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this[&#34;gateway-nsg-vnet-nle-int-01-gateway&#34;]
  * module.core-infra.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-nle-int-01-gateway&#34;]
* Update
  * module.core-infra.azurerm_key_vault.this
  * module.core-infra.azurerm_recovery_services_vault.this
  * module.core-infra.azurerm_resource_group.rg
  * module.core-infra.azurerm_storage_account.this
  * module.core-infra.azurerm_storage_account_network_rules.this
  * module.core-infra.module.networking.azurerm_network_security_group.this[&#34;backend-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_group.this[&#34;frontend-nsg&#34;]
  * module.core-infra.module.networking.azurerm_route_table.this[&#34;rt&#34;]
* Delete
  * module.core-infra.module.networking.azurerm_network_security_group.this[&#34;lb-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.deny_inbound[&#34;lb-nsg&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;lb-nsg-allow_http&#34;]
  * module.core-infra.module.networking.azurerm_network_security_rule.rules[&#34;lb-nsg-allow_https&#34;]
  * module.core-infra.module.networking.azurerm_subnet.this[&#34;vnet-nle-int-01-lb&#34;]
  * module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this[&#34;lb-nsg-vnet-nle-int-01-lb&#34;]
  * module.core-infra.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-nle-int-01-lb&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.core-infra.azurerm_key_vault.this will be updated in-place
  ~ resource "azurerm_key_vault" "this" {
        id                              = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.KeyVault/vaults/crime-portal-kv-stg"
        name                            = "crime-portal-kv-stg"
      ~ tags                            = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
          + "startupMode"  = "always"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.core-infra.azurerm_recovery_services_vault.this will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "this" {
        id                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.RecoveryServices/vaults/crime-portal-rsv-stg"
        name                          = "crime-portal-rsv-stg"
      ~ tags                          = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
          + "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)
    }

  # module.core-infra.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg"
        name     = "crime-portal-rg-stg"
      ~ tags     = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
          + "startupMode"  = "always"
        }
        # (1 unchanged attribute hidden)
    }

  # module.core-infra.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Storage/storageAccounts/crimeportalsastg"
        name                              = "crimeportalsastg"
      ~ tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
          + "startupMode"  = "always"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.core-infra.azurerm_storage_account_network_rules.this will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "this" {
        id                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Storage/storageAccounts/crimeportalsastg"
      ~ virtual_network_subnet_ids = [
          - "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-backend-postgresql-stg",
          - "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-backend-stg",
          - "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-frontend-stg",
          - "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.core-infra.module.networking.azurerm_network_security_group.this["backend-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-backend-nsg-stg"
        name                = "crime-portal-backend-nsg-stg"
      ~ tags                = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
          + "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.core-infra.module.networking.azurerm_network_security_group.this["frontend-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-frontend-nsg-stg"
        name                = "crime-portal-frontend-nsg-stg"
      ~ tags                = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
          + "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.core-infra.module.networking.azurerm_network_security_group.this["gateway-nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "crime-portal-gateway-nsg-stg"
      + resource_group_name = "InternalSpoke-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "crime-portal"
          + "builtFrom"    = "hmcts/crime-portal-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
    }

  # module.core-infra.module.networking.azurerm_network_security_group.this["lb-nsg"] will be destroyed
  # (because key ["lb-nsg"] is not in for_each map)
  - resource "azurerm_network_security_group" "this" {
      - id                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-lb-nsg-stg" -> null
      - location            = "uksouth" -> null
      - name                = "crime-portal-lb-nsg-stg" -> null
      - resource_group_name = "InternalSpoke-rg" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.0/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "lb-nsg-allow_https"
              - priority                                   = 201
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.25.246.0/28"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "lb-nsg-allow_http"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Default DenyInbound rule"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllInbound"
              - priority                                   = 4096
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> null
      - tags                = {
          - "application"  = "crime-portal"
          - "builtFrom"    = "hmcts/crime-portal-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "High"
          - "environment"  = "staging"
        } -> null
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.deny_inbound["gateway-nsg"] will be created
  + resource "azurerm_network_security_rule" "deny_inbound" {
      + access                      = "Deny"
      + description                 = "Default DenyInbound rule"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "crime-portal-gateway-nsg-stg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "InternalSpoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.deny_inbound["lb-nsg"] will be destroyed
  # (because key ["lb-nsg"] is not in for_each map)
  - resource "azurerm_network_security_rule" "deny_inbound" {
      - access                                     = "Allow" -> null
      - description                                = "Default DenyInbound rule" -> null
      - destination_address_prefix                 = "*" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "*" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-lb-nsg-stg/securityRules/DenyAllInbound" -> null
      - name                                       = "DenyAllInbound" -> null
      - network_security_group_name                = "crime-portal-lb-nsg-stg" -> null
      - priority                                   = 4096 -> null
      - protocol                                   = "*" -> null
      - resource_group_name                        = "InternalSpoke-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["gateway-nsg-allow_http"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.0/28"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "gateway-nsg-allow_http"
      + network_security_group_name = "crime-portal-gateway-nsg-stg"
      + priority                    = 200
      + protocol                    = "Tcp"
      + resource_group_name         = "InternalSpoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["gateway-nsg-allow_https"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.25.246.0/28"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "gateway-nsg-allow_https"
      + network_security_group_name = "crime-portal-gateway-nsg-stg"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "InternalSpoke-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["lb-nsg-allow_http"] will be destroyed
  # (because key ["lb-nsg-allow_http"] is not in for_each map)
  - resource "azurerm_network_security_rule" "rules" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "10.25.246.0/28" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "80" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-lb-nsg-stg/securityRules/lb-nsg-allow_http" -> null
      - name                                       = "lb-nsg-allow_http" -> null
      - network_security_group_name                = "crime-portal-lb-nsg-stg" -> null
      - priority                                   = 200 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "InternalSpoke-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.core-infra.module.networking.azurerm_network_security_rule.rules["lb-nsg-allow_https"] will be destroyed
  # (because key ["lb-nsg-allow_https"] is not in for_each map)
  - resource "azurerm_network_security_rule" "rules" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "10.25.246.0/28" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "443" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-lb-nsg-stg/securityRules/lb-nsg-allow_https" -> null
      - name                                       = "lb-nsg-allow_https" -> null
      - network_security_group_name                = "crime-portal-lb-nsg-stg" -> null
      - priority                                   = 201 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "InternalSpoke-rg" -> null
      - source_address_prefix                      = "*" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # module.core-infra.module.networking.azurerm_route.this["rt-RFC_1918_A"] will be created
  + resource "azurerm_route" "this" {
      + address_prefix         = "10.0.0.0/8"
      + id                     = (known after apply)
      + name                   = "rt-RFC_1918_A"
      + next_hop_in_ip_address = "10.11.72.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "InternalSpoke-rg"
      + route_table_name       = "crime-portal-rt-stg"
    }

  # module.core-infra.module.networking.azurerm_route.this["rt-RFC_1918_B"] will be created
  + resource "azurerm_route" "this" {
      + address_prefix         = "172.16.0.0/12"
      + id                     = (known after apply)
      + name                   = "rt-RFC_1918_B"
      + next_hop_in_ip_address = "10.11.72.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "InternalSpoke-rg"
      + route_table_name       = "crime-portal-rt-stg"
    }

  # module.core-infra.module.networking.azurerm_route.this["rt-RFC_1918_C"] will be created
  + resource "azurerm_route" "this" {
      + address_prefix         = "192.168.0.0/16"
      + id                     = (known after apply)
      + name                   = "rt-RFC_1918_C"
      + next_hop_in_ip_address = "10.11.72.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "InternalSpoke-rg"
      + route_table_name       = "crime-portal-rt-stg"
    }

  # module.core-infra.module.networking.azurerm_route_table.this["rt"] will be updated in-place
  ~ resource "azurerm_route_table" "this" {
        id                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/routeTables/crime-portal-rt-stg"
        name                          = "crime-portal-rt-stg"
      ~ tags                          = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
          + "startupMode"  = "always"
        }
        # (5 unchanged attributes hidden)
    }

  # module.core-infra.module.networking.azurerm_subnet.this["vnet-nle-int-01-gateway"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.25.246.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "crime-portal-gateway-stg"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "InternalSpoke-rg"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "vnet-nle-int-01"
    }

  # module.core-infra.module.networking.azurerm_subnet.this["vnet-nle-int-01-lb"] will be destroyed
  # (because key ["vnet-nle-int-01-lb"] is not in for_each map)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                               = [
          - "10.25.246.0/28",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg" -> null
      - name                                           = "crime-portal-lb-stg" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "InternalSpoke-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [
          - "Microsoft.Storage",
        ] -> null
      - virtual_network_name                           = "vnet-nle-int-01" -> null
    }

  # module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this["gateway-nsg-vnet-nle-int-01-gateway"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_network_security_group_association.this["lb-nsg-vnet-nle-int-01-lb"] will be destroyed
  # (because key ["lb-nsg-vnet-nle-int-01-lb"] is not in for_each map)
  - resource "azurerm_subnet_network_security_group_association" "this" {
      - id                        = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg" -> null
      - network_security_group_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/networkSecurityGroups/crime-portal-lb-nsg-stg" -> null
      - subnet_id                 = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg" -> null
    }

  # module.core-infra.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-nle-int-01-gateway"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/routeTables/crime-portal-rt-stg"
      + subnet_id      = (known after apply)
    }

  # module.core-infra.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-nle-int-01-lb"] will be destroyed
  # (because key ["rt-vnet-nle-int-01-lb"] is not in for_each map)
  - resource "azurerm_subnet_route_table_association" "this" {
      - id             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg" -> null
      - route_table_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/routeTables/crime-portal-rt-stg" -> null
      - subnet_id      = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/InternalSpoke-rg/providers/Microsoft.Network/virtualNetworks/vnet-nle-int-01/subnets/crime-portal-lb-stg" -> null
    }

Plan: 10 to add, 8 to change, 7 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"","Target":"stg_core","Vars":{}} -->